from database import KeepedReport, KeepedReportRecord
from modules.receiver import ProvidedReportHandler
from tools import Application, string_to_date
from _done_old.dumper import *


app = Application()
session = app.db_connection.session

# app.db_connection.recreate_db()
dump_defenders(session, app.storage.migration.root)
dump_orders(session, app.storage.migration.root)


export_dict = {
    '21.11.2023': [
        '0001-20231121-155000',
        '0103-20231121-151503',
        '0191-20231121-155906',
        '0327-20231121-155750',
        '0345-20231121-155151',
        '0918-20231121-155038',
        '1182-20231121-155127',
        '1709-20231121-152821', # 96 надо 95 Флюч не ушел т.к. в файле небыло номеров столбцов
        '2357-20231121-155933',
        '3203-20231121-153907',
        '3794-20231121-151751',
        '4732-20231121-154653',
        '5020-20231121-154725',
        '5665-20231121-153457',
        '6483-20231121-150202'
    ],
    '24.11.2023': [
        '0327-20231124-110129',
        '2357-20231124-122610',
        '3291-20231124-122053',
        '3481-20231124-120459',
        '4803-20231124-123608',
        '5369-20231121-170844',
        '5977-20231124-124002',
        '6254-20231121-151410'
    ],
    '28.11.2023': [
        '3255-20231128-100615',
        '6948-20231128-100744'
    ]
}

for key in export_dict:
    for export in export_dict[key]:
        prh = ProvidedReportHandler(session, export)
        prh.report.created_utc = string_to_date(key)
        if key == '21.11.2023':
            prh.get_records_migrate()
        if export == '1709-20231121-152821':
            for index, record in enumerate(prh.report_records):
                if record.linked_defender.linked_person.person_appeal == 'Флоч Василий Андреевич':
                    prh.report_records.pop(index)
                    print('- Флоч Василий Андреевич')
        prh.export()
        print(prh.report.id, prh.count)


# НЕ ОТПРАВЛЯЛИСЬ

# 3481-20231124-111825 критические ошибки в строках 1 3 10 13 вместо него отправлено 3481-20231201-145913
# 3481-20231124-111825 2 Дышеков Аскерби Асланович 23.11.1995
# 3481-20231124-111825 4 Маздогов Азамат Адилович 18.11.1995
# 3481-20231124-111825 5 Шобитов Аслан Мухамедович 04.03.1997
# 3481-20231124-111825 6 Пшеунов Мурат Тимурович 02.03.1994
# 3481-20231124-111825 7 Мудренов Артур Асланбекович 21.12.1996
# 3481-20231124-111825 8 Тхакахов Аслан Арсенович 25.12.1994
# 3481-20231124-111825 9 Безиров Рустам Артурович 19.09.1991
# 3481-20231124-111825 11 Макитов Рашид Муслимович 03.01.1996
# 3481-20231124-111825 12 Геляхов Хасан Махмудович 18.09.1994
# 3481-20231124-111825 14 Мизиев Замир Киргизбаевич 14.03.1997
# 3481-20231124-111825 15 Данилов Владимир Владимирович 11.09.1997
# 3481-20231124-111825 16 Пагов Азамат Асланович 10.08.1991
rec = session.query(KeepedReportRecord).filter(KeepedReportRecord.keeped_report_id == '3481-20231124-111825').all()
rep = session.query(KeepedReport).filter(KeepedReport.id == '3481-20231124-111825').all()
for item in rec:
    session.delete(item)
for item in rep:
    session.delete(item)

# 4803-20231124-123449 не было пустых строк вместо него отправлено 4803-20231124-123608
# 4803-20231124-123449 1 Целищев Алексей Владимирович 18.04.1979
rec = session.query(KeepedReportRecord).filter(KeepedReportRecord.keeped_report_id == '4803-20231124-123449').all()
rep = session.query(KeepedReport).filter(KeepedReport.id == '4803-20231124-123449').all()
for item in rec:
    session.delete(item)
for item in rep:
    session.delete(item)

session.commit()


test = ProvidedReportHandler(session)
for record in test.report_records:
    print(
        record.keeped_report_id, record.keep_row_num,
        record.linked_defender.linked_person.person_appeal,
        record.linked_defender.linked_person.birthday
    )

# 20231128-105016_sfr_(4 человека)
# 0327-20231128-105016 1 Васильев Иван Валерьевич 18.03.1987
# 0918-20231130-092658 1 Горюшкин Ярослав Александрович 03.10.1998
# 4803-20231129-093039 1 Петров Евгений Геннадьевич 18.02.1984
# 6713-20231129-092840 1 Попов Александр Борисович 13.01.1977
prh = ProvidedReportHandler(session)
prh.report.created_utc = string_to_date('30.11.2023')
prh.get_records_migrate_compound_one()
prh.export()


# 20231130-123409_sfr_(28 человек)
# 0001-20231130-123409 1 Кухта Михаил Васильевич 08.05.1976
# 0001-20231205-093957 1 Нестеров Алексей Валерьевич 22.07.1980
# 0115-20231205-094102 1 Литвинюк Денис Владимирович 26.11.1997
# 0115-20231205-094102 2 Рылов Сергей Николаевич 30.09.1993
# 0115-20231205-094102 3 Петров Алексей Владимирович 02.02.1984
# 0327-20231205-092409 1 Артёмов Максим Андреевич 10.05.1995
# 0441-20231130-161130 1 Быканов Дмитрий Александрович 05.07.1989
# 3219-20231205-093922 1 Никитченко Дмитрий Иванович 05.08.1978
# 3219-20231205-093922 2 Гунченко Александр Михайлович 28.11.1973
# 3481-20231201-145913 1 Дышеков Аскерби Асланович 23.11.1995
# 3481-20231201-145913 2 Ортанов Ашамаз Хажпагович 16.04.1992
# 3481-20231201-145913 3 Маздогов Азамат Адилович 18.11.1995
# 3481-20231201-145913 4 Шобитов Аслан Мухамедович 04.03.1997
# 3481-20231201-145913 5 Пшеунов Мурат Тимурович 02.03.1994
# 3481-20231201-145913 6 Мудренов Артур Асланбекович 21.12.1996
# 3481-20231201-145913 7 Тхакахов Аслан Арсенович 25.12.1994
# 3481-20231201-145913 8 Безиров Рустам Артурович 19.09.1991
# 3481-20231201-145913 9 Хамуков Хамид Борисович 01.04.1992
# 3481-20231201-145913 10 Макитов Рашид Муслимович 03.01.1996
# 3481-20231201-145913 11 Геляхов Хасан Махмудович 18.09.1994
# 3481-20231201-145913 12 Жиляев Астемир Хасенович 10.10.1991
# 3481-20231201-145913 13 Мизиев Замир Киргизбаевич 14.03.1997
# 3481-20231201-145913 14 Данилов Владимир Владимирович 11.09.1997
# 3481-20231201-145913 15 Пагов Азамат Асланович 10.08.1991
# 5721-20231201-152140 1 Чиненов Дмитрий Андреевич 01.05.1995
# 5765-20231205-093811 1 Марховец Алексей Владимирович 13.10.1987
# 5850-20231201-145105 1 Майер Максим Владимирович 13.08.1990
# 6948-20231205-093715 1 Кашковский Алексей Сергеевич 04.08.1991
prh = ProvidedReportHandler(session)
prh.report.created_utc = string_to_date('05.12.2023')
prh.get_records_migrate_compound_two()
prh.export()


# просто не отправлено
# 4451-20231121-151713 1 Ляшенко Артем Сергеевич 03.04.1990
# 5665-20231121-153343 1 Федорин Алексей Николаевич 17.11.1968
# +Флюч смотри выше
